Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.6/LowPower/Source/MKW36Z/PWRLib.c
/* For LVD function */ 
#if (cPWR_LVD_Enable == 2)
tmrTimerID_t PWRLib_LVD_PollIntervalTmrID;
PWRLib_LVD_VoltageLevel_t PWRLib_LVD_SavedLevel;
#endif /* (cPWR_LVD_Enable == 2) */

/*****************************************************************************
 *                               PUBLIC VARIABLES                            *
 *---------------------------------------------------------------------------*
 * Add to this section all the variables and constants that have global      *
 * (project) scope.                                                          *
 * These variables / constants can be accessed outside this module.          *
 * These variables / constants shall be preceded by the 'extern' keyword in  *
 * the interface header.                                                     *
 *---------------------------------------------------------------------------*
 *****************************************************************************/
volatile PWRLib_WakeupReason_t PWRLib_MCU_WakeupReason;

#if (cPWR_UsePowerDownMode == 1)
/*****************************************************************************
 *                           PRIVATE FUNCTIONS PROTOTYPES                    *
 *---------------------------------------------------------------------------*
 * Add to this section all the functions prototypes that have local (file)   *
 * scope.                                                                    *
 * These functions cannot be accessed outside this module.                   *
 * These declarations shall be preceded by the 'static' keyword.             *
 *---------------------------------------------------------------------------*
 *****************************************************************************/

/*****************************************************************************
 *                                PRIVATE FUNCTIONS                          *
 *---------------------------------------------------------------------------*
 * Add to this section all the functions that have local (file) scope.       *
 * These functions cannot be accessed outside this module.                   *
 * These definitions shall be preceded by the 'static' keyword.              *
 *---------------------------------------------------------------------------*
*****************************************************************************/

/*****************************************************************************
 *                             PUBLIC FUNCTIONS                              *
 *---------------------------------------------------------------------------*
 * Add to this section all the functions that have global (project) scope.   *
 * These functions can be accessed outside this module.                      *
 * These functions shall have their declarations (prototypes) within the     *
 * interface header file and shall be preceded by the 'extern' keyword.      *
 *---------------------------------------------------------------------------*
 *****************************************************************************/
/*---------------------------------------------------------------------------
 * Name: PWRLib_ConfigRSIM
 * Description: 
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWRLib_ConfigRSIM( uint8_t lpMode )
{
    RSIM->CONTROL &= ~(RSIM_CONTROL_RSIM_STOP_ACK_OVRD_EN_MASK);
    RSIM->RF_OSC_CTRL  = (RSIM->RF_OSC_CTRL & ~RSIM_RF_OSC_CTRL_RADIO_EXT_OSC_OVRD_MASK) | RSIM_RF_OSC_CTRL_RADIO_EXT_OSC_OVRD_EN_MASK;
    
    switch(lpMode)
    {
    case 1:
    case 7:
    case 8:
#if cPWR_BLE_LL_Enable
        RSIM->CONTROL |= RSIM_CONTROL_BLE_RF_OSC_REQ_EN_MASK | RSIM_CONTROL_BLE_RF_OSC_REQ_INT_EN_MASK | RSIM_CONTROL_BLE_RF_OSC_REQ_INT_MASK;
#endif /* cPWR_BLE_LL_Enable */
        {
            uint32_t dsmControl = 0;
            
#if cPWR_GENFSK_LL_Enable
            dsmControl |= RSIM_DSM_CONTROL_DSM_TIMER_EN_MASK | 
                          RSIM_DSM_CONTROL_GEN_SYSCLK_REQ_INT_MASK |
                          RSIM_DSM_CONTROL_GEN_SYSCLK_INTERRUPT_EN_MASK |
                          RSIM_DSM_CONTROL_GEN_SYSCLK_REQUEST_EN_MASK;
#endif /* cPWR_GENFSK_LL_Enable */
            RSIM->DSM_CONTROL = dsmControl;
        }
        break;
    case 2:
    case 3:
    case 4:
    case 5:
#if cPWR_BLE_LL_Enable
        RSIM->CONTROL &= ~(RSIM_CONTROL_BLE_RF_OSC_REQ_EN_MASK | RSIM_CONTROL_BLE_RF_OSC_REQ_INT_EN_MASK);
#endif /* cPWR_BLE_LL_Enable */
        
#if cPWR_GENFSK_LL_Enable
        RSIM->DSM_CONTROL &= ~(RSIM_DSM_CONTROL_GEN_SYSCLK_REQUEST_EN_MASK | RSIM_DSM_CONTROL_GEN_SYSCLK_INTERRUPT_EN_MASK);
#endif /* cPWR_GENFSK_LL_Enable */
        break;
    case 6:
#if cPWR_BLE_LL_Enable
        RSIM->CONTROL &= ~(RSIM_CONTROL_BLE_RF_OSC_REQ_INT_EN_MASK | RSIM_CONTROL_BLE_RF_OSC_REQ_EN_MASK) ;
#endif /* cPWR_BLE_LL_Enable */
        break;
    }
}

#if (cPWR_BLE_LL_Enable)
/*---------------------------------------------------------------------------
 * Name: PWRLib_BLL_ConfigDSM
 * Description: 
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWRLib_BLL_ConfigDSM(uint8_t lpMode)
{
    BLE_LL_REG(WAKEUP_CONFIG) = (((cPWR_BLE_LL_OffsetToWakeupInstant << BLE_LL_WAKEUP_CONFIG_DSM_OFFSET_SHIFT) & BLE_LL_WAKEUP_CONFIG_DSM_OFFSET_MASK) |
                                 ((((cPWR_BLE_LL_OscStartupDelay & BLE_LL_OSC_STARTUP_DELAY_CLK_MASK) >> BLE_LL_OSC_STARTUP_DELAY_CLK_SHIFT)<<BLE_LL_WAKEUP_CONFIG_OSC_DELAY_CLK_SHIFT) & BLE_LL_WAKEUP_CONFIG_OSC_DELAY_CLK_MASK) |
                                  BLE_LL_WAKEUP_CONFIG_CON_RAM_DSM_RET);
    BLE_LL_REG(WAKEUP_CONFIG2) = ((((cPWR_BLE_LL_OscStartupDelay & BLE_LL_OSC_STARTUP_DELAY_SLOT_MASK) >> BLE_LL_OSC_STARTUP_DELAY_SLOT_SHIFT)<<BLE_LL_WAKEUP_CONFIG2_OSC_DELAY_SLOT_SHIFT) & BLE_LL_WAKEUP_CONFIG2_OSC_DELAY_SLOT_MASK);

    if(lpMode)
    {
        BLE_LL_REG(CLOCK_CONFIG) = maBLE_LL_CLOCK_CONFIG_LP[lpMode - 1];
    }
}

