Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.6/LowPower/Source/MKW36Z/PWRLib.c
/*---------------------------------------------------------------------------
 * Name: PWRLib_MCUEnter_Stop
 * Description: Puts the processor into Stop 

                Mode of operation details:
                 - ARM core enters SleepDeep Mode
                 - ARM core is clock gated (HCLK = OFF)
                 - NVIC is disable (FCLK = OFF)
                 - Platform and peripheral clock are stopped
                 - Full SRAM retention.               
                The ALLS must be set to 0b1 in SMC_PMPROT register in order to allow LLS mode.

 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWRLib_MCU_Enter_Stop(void)
{
    SCB->SCR &= (uint32_t)~(uint32_t)(SCB_SCR_SLEEPONEXIT_Msk);
    /* Set the SLEEPDEEP bit to enable CORTEX M0 deep sleep mode */
    SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;
    SMC->PMCTRL = (uint8_t)(SMC->PMCTRL & (uint8_t)~(uint8_t)(SMC_PMCTRL_STOPM(0x07)));
    SMC->STOPCTRL = (SMC_STOPCTRL_PSTOPO(0x00) | SMC_STOPCTRL_LLSM(0x00));
    (void)(SMC->PMCTRL == 0U);  /* Dummy read of SMC_PMCTRL to ensure the register is written before enterring low power mode */
    
    /* WFI instruction will start entry into deep sleep mode */
    __asm("WFI");
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LLWU_GetWakeUpFlags
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
uint32_t PWRLib_LLWU_GetWakeUpFlags(void)
{
    uint32_t Flags;
    
    Flags = LLWU->F1;
    Flags |= (uint32_t)((uint32_t)LLWU->F2 << 8U);
    Flags |= (uint32_t)((uint32_t)LLWU->F3 << 16U);
    
    if ((LLWU->FILT1 & 0x80U) != 0x00U ) 
    {
        Flags |= LLWU_FILTER1;
    }
    
    if ((LLWU->FILT2 & 0x80U) != 0x00U ) 
    {
        Flags |= LLWU_FILTER2;
    }
    
    return Flags;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LLWU_UpdateWakeupReason
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWRLib_LLWU_UpdateWakeupReason(void)
{
    uint32_t  llwuFlags;
    
    llwuFlags =  PWRLib_LLWU_GetWakeUpFlags();
    
#if BOARD_LLWU_PIN_ENABLE_BITMAP
    if(llwuFlags & BOARD_LLWU_PIN_ENABLE_BITMAP)
    {
        PWRLib_MCU_WakeupReason.Bits.FromKeyBoard = 1; 
    }
#endif /* BOARD_LLWU_PIN_ENABLE_BITMAP */
    
    if(llwuFlags & gPWRLib_LLWU_WakeupModuleFlag_LPTMR_c)
    {
        PWRLib_MCU_WakeupReason.Bits.FromLPTMR = 1;
        PWRLib_MCU_WakeupReason.Bits.DeepSleepTimeout = 1;
    }
    
    if(llwuFlags & gPWRLib_LLWU_WakeupModuleFlag_Radio_c)
    {
        PWRLib_MCU_WakeupReason.Bits.FromBLE_LLTimer = 1;
        
        if(RSIM->DSM_CONTROL & (RSIM_DSM_CONTROL_GEN_SYSCLK_REQ_INT_MASK))
        {
            PWRLib_MCU_WakeupReason.Bits.FromRadio = 1;
        }
        
        PWRLib_MCU_WakeupReason.Bits.DeepSleepTimeout = 1;
    }
    
    if(llwuFlags & gPWRLib_LLWU_WakeupModuleFlag_DCDC_c)
    {
        PWRLib_MCU_WakeupReason.Bits.FromPSwitch_UART = 1;
    }
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LLWU_DisableAllWakeupSources
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWRLib_LLWU_DisableAllWakeupSources(void)
{
    LLWU->PE1 = 0;
    LLWU->PE2 = 0;
    LLWU->PE3 = 0;
    LLWU->PE4 = 0;
    LLWU->ME = 0;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_GetTimeSettings
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWRLib_LPTMR_GetTimeSettings(uint32_t timeInMs, uint8_t* pClkMode,uint32_t* pTicks, uint32_t* pFreq)
{
    uint64_t ticks64;
    uint32_t ticks;
    uint8_t prescaler = 0;
    uint8_t bypass = LPTMR_PSR_PBYP_MASK;
    uint32_t freq = 32768;
    
    if(timeInMs > mLptmrTimoutMaxMs_c)
    {
        timeInMs = mLptmrTimoutMaxMs_c;
    }
    
    ticks64 = timeInMs;
    ticks64 *= 32768;
    ticks64 /= 1000;
    ticks = ticks64;
    
    while(ticks & 0xFFFF0000)
    {
        if(bypass)
        {
            bypass = 0;
        }
        else
        {
            prescaler++;
        }
        
        ticks >>= 1;
        freq >>= 1;
    }
    
    *pClkMode = (prescaler<<LPTMR_PSR_PRESCALE_SHIFT)| bypass | cLPTMR_Source_Ext_ERCLK32K;
    *pTicks = ticks;
    *pFreq = freq;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_ClockStart
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWRLib_LPTMR_ClockStart(uint8_t ClkMode, uint32_t Ticks)
{
    OSA_InterruptDisable();
    
    LPTMR0->CSR &= ~LPTMR_CSR_TEN_MASK;
    
    /* Set compare value */
    if(Ticks)
    {
        Ticks--;
    }
    
    LPTMR0->CMR = Ticks;
    /* Use specified tick count */
    mPWRLib_RTIElapsedTicks = 0;
    /* Configure prescaler, bypass prescaler and clck source */
    LPTMR0->PSR = ClkMode;
    LPTMR0->CSR |= LPTMR_CSR_TFC_MASK;
    /* Start counting */
    LPTMR0->CSR |= LPTMR_CSR_TEN_MASK;
    
    OSA_InterruptEnable();
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_ClockCheck
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
uint32_t PWRLib_LPTMR_ClockCheck(void)
{
    OSA_InterruptDisable();
    
    /* LPTMR is still running */
    if(LPTMR0->CSR & LPTMR_CSR_TEN_MASK)
    {
        LPTMR0->CNR = 0;  /* CNR must be written first in order to be read */
        mPWRLib_RTIElapsedTicks = LPTMR0->CNR;
        
        /* timer compare flag is set */
        if(LPTMR0->CSR & LPTMR_CSR_TCF_MASK)
        {
            uint32_t compareReg;
            
            compareReg = LPTMR0->CMR;
            
