Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.6/LowPower/Source/MKW36Z/PWRLib.c
            if(mPWRLib_RTIElapsedTicks < compareReg)
            {
                mPWRLib_RTIElapsedTicks += 0x10000;
            }
        }
    }
    
    OSA_InterruptEnable();
    
    return mPWRLib_RTIElapsedTicks;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_ClockStop
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWRLib_LPTMR_ClockStop(void)
{
    OSA_InterruptDisable();
    
    /* LPTMR is still running */
    if(LPTMR0->CSR & LPTMR_CSR_TEN_MASK)
    {
        LPTMR0->CNR = 0;  /* CNR must be written first in order to be read */
        mPWRLib_RTIElapsedTicks = LPTMR0->CNR;
        
        /* timer compare flag is set */
        if(LPTMR0->CSR & LPTMR_CSR_TCF_MASK)
        {
            uint32_t compareReg;
            
            compareReg = LPTMR0->CMR;
            
            if(mPWRLib_RTIElapsedTicks < compareReg)
            {
                mPWRLib_RTIElapsedTicks += 0x10000;
            }
        }
    }
    
    /* Stop LPTMR */
    LPTMR0->CSR &= ~LPTMR_CSR_TEN_MASK;
    
    OSA_InterruptEnable();
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_StopUpdateWakeupReason
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWRLib_StopUpdateWakeupReason(void)
{
    uint32_t iser;
    uint32_t ispr;
    
    iser = NVIC->ISER[0];
    ispr = NVIC->ISPR[0];

    if(( iser & ispr) & (1 << mUartIrq_d))
    {
        PWRLib_MCU_WakeupReason.Bits.FromPSwitch_UART = 1;
    }
    
    if(( iser & ispr) & (1 << LVD_LVW_DCDC_IRQn))
    {
        PWRLib_MCU_WakeupReason.Bits.FromPSwitch_UART = 1;
    }
    
    if((iser & ispr) & (1 << Radio_0_IRQn | 1 << Radio_1_IRQn))
    {
        PWRLib_MCU_WakeupReason.Bits.FromRadio = 1;
#if cPWR_GENFSK_LL_Enable
        if((GENFSK->IRQ_CTRL & (GENFSK_IRQ_CTRL_WAKE_IRQ_EN_MASK | GENFSK_IRQ_CTRL_GENERIC_FSK_IRQ_EN_MASK |GENFSK_IRQ_CTRL_WAKE_IRQ_MASK)) == 
           (GENFSK_IRQ_CTRL_WAKE_IRQ_EN_MASK | GENFSK_IRQ_CTRL_GENERIC_FSK_IRQ_EN_MASK |GENFSK_IRQ_CTRL_WAKE_IRQ_MASK))
        {
            PWRLib_MCU_WakeupReason.Bits.DeepSleepTimeout = 1;
        }        
#endif /* cPWR_GENFSK_LL_Enable */
    }
    
    if((iser & ispr) & (1 << LPTMR0_IRQn))
    {
        PWRLib_MCU_WakeupReason.Bits.FromLPTMR = 1;
        PWRLib_MCU_WakeupReason.Bits.DeepSleepTimeout = 1;   
    }
    
    if(KBD_IsWakeUpSource())
    {
        PWRLib_MCU_WakeupReason.Bits.FromKeyBoard = 1;
    }
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_Isr
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWRLib_LPTMR_Isr(void)
{
    LPTMR0->CSR |= LPTMR_CSR_TCF_MASK;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_Init
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWRLib_LPTMR_Init(void)
{
    OSA_InstallIntHandler(LPTMR0_IRQn,PWRLib_LPTMR_Isr);
    SIM->SCGC5 |= SIM_SCGC5_LPTMR_MASK;
    
    LPTMR0->CSR = (LPTMR_CSR_TCF_MASK | LPTMR_CSR_TPS(0x00));  /* Clear control register */
    LPTMR0->CMR = LPTMR_CMR_COMPARE(0x02);  /* Set up compare register */
    NVIC->IP[7] &= ~0x000000FFu;
    NVIC->IP[7] |=  0x80;
    NVIC->ISER[0] |= 0x10000000;
    LPTMR0->CSR = (LPTMR_CSR_TIE_MASK | LPTMR_CSR_TPS(0x00));  /* Set up control register */    
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_ReInit
 * Description: - ReInitialize the LPTMR after wakeup from lowpower (VLLS2/3)
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWRLib_LPTMR_ReInit(void)
{
    CLOCK_EnableClock(kCLOCK_Lptmr0);
    NVIC_SetPriority(LPTMR0_IRQn, 0x80 >> (8 - __NVIC_PRIO_BITS));
    NVIC_EnableIRQ(LPTMR0_IRQn);
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_DeInit
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWRLib_LPTMR_DeInit(void)
{
    LPTMR0->CSR = LPTMR_CSR_TCF_MASK;  /* Clear control register */
    SIM->SCGC5 &= ~SIM_SCGC5_LPTMR_MASK;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LLWU_Isr
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWRLib_LLWU_Isr(void)
{
    uint32_t llwuFlags;
    
    llwuFlags = PWRLib_LLWU_GetWakeUpFlags();
    /* Clear external pins wakeup interrupts */
    LLWU->F1 = LLWU->F1; 
    LLWU->F2 = LLWU->F2; 
    
    /* LPTMR is wakeup source */
    if(llwuFlags & gPWRLib_LLWU_WakeupModuleFlag_LPTMR_c)  
    {
        /* Clear LPTMR interrupt */
        LPTMR0->CSR |= LPTMR_CSR_TCF_MASK;
    }
    
    if(llwuFlags & gPWRLib_LLWU_WakeupModuleFlag_Radio_c)  
    {
        /* Clear RSIM interrupt */    
        if(RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_BLE_RF_OSC_REQ_INT))
        {
            RSIM->CONTROL = RSIM->CONTROL;
        }
        
        RSIM->DSM_CONTROL = RSIM->DSM_CONTROL;
    }
    
    if(llwuFlags & gPWRLib_LLWU_WakeupModuleFlag_DCDC_c)  
    {
        /* Clear pSwitch interrupt */
        DCDC->REG6 |= DCDC_REG6_PSWITCH_INT_CLEAR_MASK;
        DCDC->REG6 &= ~DCDC_REG6_PSWITCH_INT_CLEAR_MASK;
    }
}
#endif /* #if (cPWR_UsePowerDownMode==1) */

/*---------------------------------------------------------------------------
* Name: PWRLib_LVD_CollectLevel
* Description: -
* Parameters: -
* Return: -
*---------------------------------------------------------------------------*/
PWRLib_LVD_VoltageLevel_t PWRLib_LVD_CollectLevel(void)
{
#if ((cPWR_LVD_Enable == 1) || (cPWR_LVD_Enable == 2))
    
