Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.6/LowPower/Source/MKW36Z/PWRLib.c
        if(RCM->SRS0 & RCM_SRS0_PIN_MASK)
        {
            PWRLib_MCU_WakeupReason.Bits.FromReset = 1;
        }
    }
#if BOARD_LLWU_PIN_ENABLE_BITMAP
    {
        uint16_t pinEn16 = BOARD_LLWU_PIN_ENABLE_BITMAP;
        uint32_t PinEn32 = 0;
        uint32_t i;
        for(i=0; pinEn16 ; i++)
        {
            if(pinEn16 & 0x1)
            {
                PinEn32 |= 0x3<<(i<<1);
            }
            pinEn16 >>= 1;
        }
        LLWU->PE1 = PinEn32&0xff;
        LLWU->PE2 = (PinEn32>>8)&0xff;
        LLWU->PE3 = (PinEn32>>16)&0xff;
        LLWU->PE4 = (PinEn32>>24)&0xff;
    }
#endif /* BOARD_LLWU_PIN_ENABLE_BITMAP */
    
    /* LLWU_FILT1: FILTF=1,FILTE=0,??=0,FILTSEL=0 */
    LLWU->FILT1 = LLWU_FILT1_FILTF_MASK |
                  LLWU_FILT1_FILTE(0x00) |
                  LLWU_FILT1_FILTSEL(0x00);
    
    /* LLWU_FILT2: FILTF=1,FILTE=0,??=0,FILTSEL=0 */
    LLWU->FILT2 = LLWU_FILT2_FILTF_MASK |
                  LLWU_FILT2_FILTE(0x00) |
                  LLWU_FILT2_FILTSEL(0x00);
    
    /* SMC_PMPROT: ??=0,??=0,AVLP=1,??=0,ALLS=1,??=0,AVLLS=1,??=0 */
    SMC->PMPROT = SMC_PMPROT_AVLP_MASK |
                  SMC_PMPROT_ALLS_MASK |
                  SMC_PMPROT_AVLLS_MASK;  /* Setup Power mode protection register */
    
    /* Install LLWU ISR and validate it in NVIC */
    OSA_InstallIntHandler(LLWU_IRQn, PWRLib_LLWU_Isr);
    NVIC_EnableIRQ(LLWU_IRQn);
    NVIC_SetPriority(LLWU_IRQn, 2);
    
#if (gKeyBoardSupported_d == 0) 
#if gLowPower_switchPinsToInitBitmap_d
    {
        uint32_t pinIndex = gLowPower_switchPinsToInitBitmap_d;
        uint32_t i;
        
        for(i = 0; pinIndex; i++)
        {
            if(pinIndex & 0x1)
            {
                (void)GpioInputPinInit(&switchPins[i], 1);
            }
            
            pinIndex >>= 1;
        }
    }
#endif /* gLowPower_switchPinsToInitBitmap_d */
#endif /* (gKeyBoardSupported_d == 0) */
    
#if cPWR_BLE_LL_Enable 
    if((SIM->SCGC5 & SIM_SCGC5_BTLL_MASK) == 0)
    {
        SIM->SCGC5 |= SIM_SCGC5_BTLL_MASK;
    }
    
    PWRLib_BLL_ConfigDSM(mPWRLib_DeepSleepMode);
#endif  /* cPWR_BLE_LL_Enable */
    
    PWRLib_ConfigRSIM(mPWRLib_DeepSleepMode);
    PWRLib_ConfigLLWU(mPWRLib_DeepSleepMode);
    
    if(maLPModeUseLPTMR[mPWRLib_DeepSleepMode])
    {
        PWRLib_LPTMR_Init();
    }
    
#endif /* (cPWR_UsePowerDownMode == 1) */
    
    /* LVD_Init TBD */
#if (cPWR_LVD_Enable == 0)
    PMC->LVDSC1 &= (uint8_t) ~( PMC_LVDSC1_LVDIE_MASK  | PMC_LVDSC1_LVDRE_MASK);
    PMC->LVDSC2 &= (uint8_t) ~( PMC_LVDSC2_LVWIE_MASK );
#elif ((cPWR_LVD_Enable == 1) || (cPWR_LVD_Enable == 2))
    PMC->LVDSC1 &= (uint8_t) ~( PMC_LVDSC1_LVDIE_MASK | PMC_LVDSC1_LVDRE_MASK);
    PMC->LVDSC2 &= (uint8_t) ~( PMC_LVDSC2_LVWIE_MASK );
#elif (cPWR_LVD_Enable==3)
    PMC->LVDSC1 = (PMC->LVDSC1 | (uint8_t)PMC_LVDSC1_LVDRE_MASK) & (uint8_t)(~PMC_LVDSC1_LVDIE_MASK );
    PMC->LVDSC2 &= (uint8_t) ~( PMC_LVDSC2_LVWIE_MASK );
#endif /* (cPWR_LVD_Enable) */

#if (cPWR_LVD_Enable == 2)
#if ((cPWR_LVD_Ticks == 0) || (cPWR_LVD_Ticks > 71582))
#error  "*** ERROR: cPWR_LVD_Ticks invalid value"
#endif /* ((cPWR_LVD_Ticks == 0) || (cPWR_LVD_Ticks > 71582)) */
    
    PWRLib_LVD_SavedLevel = PWRLib_LVD_CollectLevel(); 
    
    /* Allocate a platform timer */
    PWRLib_LVD_PollIntervalTmrID = TMR_AllocateTimer();
    
    if(gTmrInvalidTimerID_c != PWRLib_LVD_PollIntervalTmrID)
    {
        /* start the timer */
        TMR_StartLowPowerTimer(PWRLib_LVD_PollIntervalTmrID, gTmrIntervalTimer_c,TmrMinutes(cPWR_LVD_Ticks) , PWRLib_LVD_PollIntervalCallback, NULL);
    }
#endif /* (cPWR_LVD_Enable == 2) */
}
/*---------------------------------------------------------------------------
 * Name: PWR_RegisterWarmbootCallback
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWR_RegisterWarmbootCallback(pfPWRCallBack_t warmBootCallback)
{
#if (cPWR_UsePowerDownMode)
    gpfPWR_WarmbootCb = warmBootCallback;
#endif /* (cPWR_UsePowerDownMode) */
}
/*---------------------------------------------------------------------------
 * Name: PWR_RegisterVLLSEnterCallback
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
void PWR_RegisterVLLSEnterCallback(pfPWRCallBack_t vllsEnterCallback)
{
#if (cPWR_UsePowerDownMode)
    gpfPWR_VLLS_EnterCb = vllsEnterCallback;
#endif /* (cPWR_UsePowerDownMode) */
}

/*---------------------------------------------------------------------------
* Name: warmmain
* Description: - Overide the weak warmmain function in Base SDK
*              - Entry point for warm boot (no data/bss initialization)
* Parameters: -
* Return: -
*---------------------------------------------------------------------------*/
#if cPWR_UsePowerDownMode && (cPWR_EnableDeepSleepMode_8 || cPWR_EnableDeepSleepMode_5)
void warmmain(void)
{
    /* Interrupts should be disabled */
    __disable_irq();

    if(gpfPWR_WarmbootCb != NULL)
    {
        gpfPWR_WarmbootCb();
    }

#if defined(USE_RTOS) && (USE_RTOS)
    /* Switch to the psp stack. */
    asm("movs r0, #2");
    asm("msr CONTROL, r0");
#endif

    /* Restore previous context */
    longjmp(pwr_CPUContext, TRUE);
}
#endif
